{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 64, 38], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u001d\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000\u0088\u0000\u0000f\u0003\u0000\u0019S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000a(\u0001\u0000\u0000\u0000t\u0005\u0000\u0000\u0000group(\u0000\u0000\u0000\u0000s>\u0000\u0000\u0000/media/workarea/eclipse-workspace/nostromo/src/FT_CNN_Model.pyt\b\u0000\u0000\u0000<lambda>\b\u0002\u0000\u0000t\u0000\u0000\u0000\u0000", null, [[34, 35, 36, 37]]], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [64, 4], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u001d\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000\u0088\u0000\u0000f\u0003\u0000\u0019S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000a(\u0001\u0000\u0000\u0000t\u0005\u0000\u0000\u0000group(\u0000\u0000\u0000\u0000s>\u0000\u0000\u0000/media/workarea/eclipse-workspace/nostromo/src/FT_CNN_Model.pyt\b\u0000\u0000\u0000<lambda>\b\u0002\u0000\u0000t\u0000\u0000\u0000\u0000", null, [[34, 35, 36, 37]]], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [64, 4], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "LayerNorm1D", "config": {"trainable": true, "name": "layer_norm1d_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "layer_norm1d_1"}, {"class_name": "LayerNorm1D", "config": {"trainable": true, "name": "layer_norm1d_2"}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "layer_norm1d_2"}, {"class_name": "Reshape", "config": {"target_shape": [64, 4], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["layer_norm1d_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Reshape", "config": {"target_shape": [64, 4], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["layer_norm1d_2", 0, 0, {}]]], "name": "reshape_2"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv1d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Ones", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Ones", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 2}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv1d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Ones", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "flatten_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_5"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "dense_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}, "backend": "theano"}